Первоочередная задача - настроить среду:
* выбрать ОС
* установить IDE, компилятор (возможно выбрать облачную среду)
* проработать примеры из lecture1.ipynb. Можно использовать clang++, msvc (по настройке msvc искать материалы придётся самостоятельно), или же g++, если выбрали облако или linux

* задание:
	Необходимо написать программу которая умеет работать с аргументами командной строки (argc, argv) и поздороваться со строкой, которую передали в программу. Уметь компилировать пример.

	Help:

		Для вывода на консоль подключаем модуль `#include <iostream>`
		
		Сам вывод происходит тут `std::cout << "Hello " << name << "!" << std::endl;`
		
		Аргумент командной строки берём отсюда int main(int argc, char* argv[]), при этом argv - это массив из строк, поэтому его можно использовать для вывода на консоль.
